***Basics***

***To Import csv***

In [2]:
import pandas as pd 
df=pd.read_csv('student_data.csv')
df

   Student_ID  Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
0           1    Male           2             75              45         50.0
1           2  Female           4             85              60         65.0
2           3    Male           6             90              72         78.0
3           4  Female        n.a.             88              68         74.0
4           5    Male           3             70              50          NaN
5           6  Female           7             95              80         85.0
6           7    Male           1  not available              40         45.0
7           8  Female           6             92              75         82.0
8           9    Male           4             80              58         62.0
9          10  Female           5             87              65         70.0

***Importing data using dictionary***

In [3]:
student={
    'Gender':['Female','Male','Female'],
    'Study_Hours':[6,2,3],
    'Attendance':[75,85,96],
    'Marks_scored':[98,70,85]
}
new_df=pd.DataFrame(student)
new_df

   Gender  Study_Hours  Attendance  Marks_scored
0  Female            6          75            98
1    Male            2          85            70
2  Female            3          96            85

In [4]:
df.shape # to get number of rows and columns

(10, 6)

In [5]:
rows,columns=df.shape
rows

10

In [6]:
new_df.shape

(3, 4)

In [7]:
df.head() # 1st 5 values default

   Student_ID  Gender Study_Hours Attendance  Internal_Marks  Final_Marks
0           1    Male           2         75              45         50.0
1           2  Female           4         85              60         65.0
2           3    Male           6         90              72         78.0
3           4  Female        n.a.         88              68         74.0
4           5    Male           3         70              50          NaN

In [8]:
df.tail() #last 5 values default

   Student_ID  Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
5           6  Female           7             95              80         85.0
6           7    Male           1  not available              40         45.0
7           8  Female           6             92              75         82.0
8           9    Male           4             80              58         62.0
9          10  Female           5             87              65         70.0

In [9]:
df.head(7) # we can also set values like how many rows we want

   Student_ID  Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
0           1    Male           2             75              45         50.0
1           2  Female           4             85              60         65.0
2           3    Male           6             90              72         78.0
3           4  Female        n.a.             88              68         74.0
4           5    Male           3             70              50          NaN
5           6  Female           7             95              80         85.0
6           7    Male           1  not available              40         45.0

***Slicing***

In [10]:
df[2:5] # neglects 5th row

   Student_ID  Gender Study_Hours Attendance  Internal_Marks  Final_Marks
2           3    Male           6         90              72         78.0
3           4  Female        n.a.         88              68         74.0
4           5    Male           3         70              50          NaN

In [11]:
df.Gender

0      Male
1    Female
2      Male
3    Female
4      Male
5    Female
6      Male
7    Female
8      Male
9    Female
Name: Gender, dtype: object

In [12]:
df['Gender']

0      Male
1    Female
2      Male
3    Female
4      Male
5    Female
6      Male
7    Female
8      Male
9    Female
Name: Gender, dtype: object

In [13]:
type(df.Gender)

pandas.core.series.Series

In [14]:
df[['Gender','Attendance']]

   Gender     Attendance
0    Male             75
1  Female             85
2    Male             90
3  Female             88
4    Male             70
5  Female             95
6    Male  not available
7  Female             92
8    Male             80
9  Female             87

In [15]:
df.Final_Marks.max() # To find maximum value in column

85.0

In [16]:
df.Final_Marks.min() # To find minimum value in column

45.0

In [17]:
df.Final_Marks.mean() # To find mean value in column

67.88888888888889

In [18]:
df.Final_Marks.std() # To find standard deviation

13.79714141085432

In [19]:
df.describe()

       Student_ID  Internal_Marks  Final_Marks
count    10.00000       10.000000     9.000000
mean      5.50000       61.300000    67.888889
std       3.02765       13.208162    13.797141
min       1.00000       40.000000    45.000000
25%       3.25000       52.000000    62.000000
50%       5.50000       62.500000    70.000000
75%       7.75000       71.000000    78.000000
max      10.00000       80.000000    85.000000

In [20]:
df[df.Final_Marks>65]

   Student_ID  Gender Study_Hours Attendance  Internal_Marks  Final_Marks
2           3    Male           6         90              72         78.0
3           4  Female        n.a.         88              68         74.0
5           6  Female           7         95              80         85.0
7           8  Female           6         92              75         82.0
9          10  Female           5         87              65         70.0

In [21]:
df[df.Final_Marks==df.Final_Marks.max()]

   Student_ID  Gender Study_Hours Attendance  Internal_Marks  Final_Marks
5           6  Female           7         95              80         85.0

In [22]:
df['Study_Hours'][df.Final_Marks==df.Final_Marks.max()] # specifically needed column

5    7
Name: Study_Hours, dtype: object

In [23]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [24]:
df.set_index('Student_ID') # it does not replace original data

            Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
Student_ID
1             Male           2             75              45         50.0
2           Female           4             85              60         65.0
3             Male           6             90              72         78.0
4           Female        n.a.             88              68         74.0
5             Male           3             70              50          NaN
6           Female           7             95              80         85.0
7             Male           1  not available              40         45.0
8           Female           6             92              75         82.0
9             Male           4             80              58         62.0
10          Female           5             87              65         70.0

In [25]:
df

   Student_ID  Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
0           1    Male           2             75              45         50.0
1           2  Female           4             85              60         65.0
2           3    Male           6             90              72         78.0
3           4  Female        n.a.             88              68         74.0
4           5    Male           3             70              50          NaN
5           6  Female           7             95              80         85.0
6           7    Male           1  not available              40         45.0
7           8  Female           6             92              75         82.0
8           9    Male           4             80              58         62.0
9          10  Female           5             87              65         70.0

***df.set_index('Student_ID',inplace=True) ==> This line replace the original data by changing student id as index***

***df.reset_index[inplace=True] ==> by using this we can get our original data after replacing***

In [26]:
df.loc[3]

Student_ID             4
Gender            Female
Study_Hours         n.a.
Attendance            88
Internal_Marks        68
Final_Marks         74.0
Name: 3, dtype: object

***Different ways of creating DataFrame***

***By importing CSV***

In [30]:
import pandas as pd 
df=pd.read_csv('student_data.csv')
df

   Student_ID  Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
0           1    Male           2             75              45         50.0
1           2  Female           4             85              60         65.0
2           3    Male           6             90              72         78.0
3           4  Female        n.a.             88              68         74.0
4           5    Male           3             70              50          NaN
5           6  Female           7             95              80         85.0
6           7    Male           1  not available              40         45.0
7           8  Female           6             92              75         82.0
8           9    Male           4             80              58         62.0
9          10  Female           5             87              65         70.0

***By importing Excel***

In [31]:
df=pd.read_excel('Customer_data.xlsx','Sheet1')
df

        Date  Customer_ID Num_of_Items           Name
0 2026-02-01            3            6        Neville
1 2026-02-02            4         n.a.            Ron
2 2026-02-03            5            2  not available
3 2026-02-04            7            5          Harry
4 2026-02-05            2            1       Hermoine

***By using Dictionary***

In [32]:
student={
    'Gender':['Female','Male','Female'],
    'Study_Hours':[6,2,3],
    'Attendance':[75,85,96],
    'Marks_scored':[98,70,85]
}
new_df=pd.DataFrame(student)
new_df

   Gender  Study_Hours  Attendance  Marks_scored
0  Female            6          75            98
1    Male            2          85            70
2  Female            3          96            85

***By using list of Tuples***

In [33]:
student=[
    ('Female',6,75,98),
    ('Male',2,85,70),
    ('Female',3,96,85)
]
df=pd.DataFrame(student,columns=['Gender','Study_Hours','Attendance','Marks_Scored'])
df

   Gender  Study_Hours  Attendance  Marks_Scored
0  Female            6          75            98
1    Male            2          85            70
2  Female            3          96            85

***By using list of Dictionaries***

In [34]:
student=[
    {'Gender':'Female','Study_Hours':6,'Attendance':75,'Marks_Scored':98},
    {'Gender':'Male','Study_Hours':2,'Attendance':85,'Marks_Scored':70},
    {'Gender':'Female','Study_Hours':3,'Attendance':96,'Marks_Scored':85}
]
df=pd.DataFrame(student)
df

   Gender  Study_Hours  Attendance  Marks_Scored
0  Female            6          75            98
1    Male            2          85            70
2  Female            3          96            85

***Reading,Writing CSV and Excel***

***For CSV***

In [35]:
import pandas as pd 
df=pd.read_csv('student_data.csv')
df

   Student_ID  Gender Study_Hours     Attendance  Internal_Marks  Final_Marks
0           1    Male           2             75              45         50.0
1           2  Female           4             85              60         65.0
2           3    Male           6             90              72         78.0
3           4  Female        n.a.             88              68         74.0
4           5    Male           3             70              50          NaN
5           6  Female           7             95              80         85.0
6           7    Male           1  not available              40         45.0
7           8  Female           6             92              75         82.0
8           9    Male           4             80              58         62.0
9          10  Female           5             87              65         70.0

In [36]:
df=pd.read_csv('student_data.csv',skiprows=1) # skip one row
df

    1    Male     2             75  45    50
0   2  Female     4             85  60  65.0
1   3    Male     6             90  72  78.0
2   4  Female  n.a.             88  68  74.0
3   5    Male     3             70  50   NaN
4   6  Female     7             95  80  85.0
5   7    Male     1  not available  40  45.0
6   8  Female     6             92  75  82.0
7   9    Male     4             80  58  62.0
8  10  Female     5             87  65  70.0

In [37]:
df=pd.read_csv('student_data.csv',header=1) # skip one row same as skiprows
df

    1    Male     2             75  45    50
0   2  Female     4             85  60  65.0
1   3    Male     6             90  72  78.0
2   4  Female  n.a.             88  68  74.0
3   5    Male     3             70  50   NaN
4   6  Female     7             95  80  85.0
5   7    Male     1  not available  40  45.0
6   8  Female     6             92  75  82.0
7   9    Male     4             80  58  62.0
8  10  Female     5             87  65  70.0

In [38]:
df=pd.read_csv('student_data.csv',header=None,names=['Student_ID','Gender','Hours','Attendance','Internal_marks','Final_marks'],nrows=3) # names set title for our columns and nrows gives number of rows we want in results
df

   Student_ID  Gender        Hours  Attendance  Internal_marks  Final_marks
0  Student_ID  Gender  Study_Hours  Attendance  Internal_Marks  Final_Marks
1           1    Male            2          75              45           50
2           2  Female            4          85              60           65

In [39]:
df=pd.read_csv('student_data.csv',na_values=['n.a.','not available']) # fills n.a. and not available with NaN
df

   Student_ID  Gender  Study_Hours  Attendance  Internal_Marks  Final_Marks
0           1    Male          2.0        75.0              45         50.0
1           2  Female          4.0        85.0              60         65.0
2           3    Male          6.0        90.0              72         78.0
3           4  Female          NaN        88.0              68         74.0
4           5    Male          3.0        70.0              50          NaN
5           6  Female          7.0        95.0              80         85.0
6           7    Male          1.0         NaN              40         45.0
7           8  Female          6.0        92.0              75         82.0
8           9    Male          4.0        80.0              58         62.0
9          10  Female          5.0        87.0              65         70.0

In [40]:
# To change values in specific columns or according to columns
df=pd.read_csv('student_data.csv',na_values={
    'Study_Hours':['n.a.','not available'],
    'Attendance':['n.a.','not available',-1],
    'Final_Marks':['n.a.','not available',-1]
})
df

   Student_ID  Gender  Study_Hours  Attendance  Internal_Marks  Final_Marks
0           1    Male          2.0        75.0              45         50.0
1           2  Female          4.0        85.0              60         65.0
2           3    Male          6.0        90.0              72         78.0
3           4  Female          NaN        88.0              68         74.0
4           5    Male          3.0        70.0              50          NaN
5           6  Female          7.0        95.0              80         85.0
6           7    Male          1.0         NaN              40         45.0
7           8  Female          6.0        92.0              75         82.0
8           9    Male          4.0        80.0              58         62.0
9          10  Female          5.0        87.0              65         70.0

In [41]:
# To write it in new csv
df.to_csv('new_student.csv',index=False)

In [44]:
import pandas as pd 
df=pd.read_csv('new_student.csv')
df

   Student_ID  Study_Hours  Final_Marks
0           1          2.0         50.0
1           2          4.0         65.0
2           3          6.0         78.0
3           4          NaN         74.0
4           5          3.0          NaN
5           6          7.0         85.0
6           7          1.0         45.0
7           8          6.0         82.0
8           9          4.0         62.0
9          10          5.0         70.0

In [43]:
# If we need specific Columns
df.to_csv('new_student.csv',index=False,columns=['Student_ID','Study_Hours','Final_Marks'])

In [45]:
import pandas as pd 
df=pd.read_csv('new_student.csv')
df

   Student_ID  Study_Hours  Final_Marks
0           1          2.0         50.0
1           2          4.0         65.0
2           3          6.0         78.0
3           4          NaN         74.0
4           5          3.0          NaN
5           6          7.0         85.0
6           7          1.0         45.0
7           8          6.0         82.0
8           9          4.0         62.0
9          10          5.0         70.0

***For Excel***

In [46]:
df=pd.read_excel('Customer_data.xlsx','Sheet1')
df

        Date  Customer_ID Num_of_Items           Name
0 2026-02-01            3            6        Neville
1 2026-02-02            4         n.a.            Ron
2 2026-02-03            5            2  not available
3 2026-02-04            7            5          Harry
4 2026-02-05            2            1       Hermoine

In [47]:
def convert_Name_cell(cell):
    if cell =='not available':
        return 'Draco'
    return cell
def convert_Num_of_Items_cell(cell):
    if cell =='n.a.':
        return 8
    return cell
df=pd.read_excel('Customer_data.xlsx','Sheet1',converters={
    'Name':convert_Name_cell,
    'Num_of_Items':convert_Num_of_Items_cell
})
df

        Date  Customer_ID  Num_of_Items      Name
0 2026-02-01            3             6   Neville
1 2026-02-02            4             8       Ron
2 2026-02-03            5             2     Draco
3 2026-02-04            7             5     Harry
4 2026-02-05            2             1  Hermoine

In [48]:
# to write it in new Excel
df.to_excel('new_customer.xlsx',sheet_name='customer',startrow=1,startcol=2)

In [49]:
# to write two dataframe in one excel ==> meaning 2 sheets in one
df_customer=pd.DataFrame({
    'ID':[1,2,3],
    'Name':['Ron','Hermoine','Harry'],
    'No_of_items':[2,3,4]
})
df_student=pd.DataFrame({
    'ID':[1,2,3],
    'Study_Hours':[5,3,4],
    'Final_Marks':[98,85,92]
})
with pd.ExcelWriter('customer_student.xlsx') as writer:
    df_customer.to_excel(writer,sheet_name='customer')
    df_student.to_excel(writer,sheet_name='student')

In [52]:
df=pd.read_excel('Customer_student.xlsx','student')
df

   Unnamed: 0  ID  Study_Hours  Final_Marks
0           0   1            5           98
1           1   2            3           85
2           2   3            4           92

In [53]:
df=pd.read_excel('Customer_student.xlsx','customer')
df

   Unnamed: 0  ID      Name  No_of_items
0           0   1       Ron            2
1           1   2  Hermoine            3
2           2   3     Harry            4